In [1]:
import numpy as np

In [9]:
demo = np.array([[1, 2], [3, 4], [5, 6]])

In [10]:
demo

array([[1, 2],
       [3, 4],
       [5, 6]])

In [11]:
demo1 = np.array(1)

In [12]:
demo1

array(1)

In [13]:
demo2 = np.array([1])

In [14]:
demo2

array([1])

demo1[1]

In [16]:
demo1[0]

IndexError: too many indices for array: array is 0-dimensional, but 1 were indexed

In [17]:
demo2[0]

np.int64(1)

In [18]:
demo1 * np.array([[1, 2]])

array([[1, 2]])

In [19]:
demo * np.array([[1, 2]])

array([[ 1,  4],
       [ 3,  8],
       [ 5, 12]])

In [20]:
demo * np.array([1, 2])

array([[ 1,  4],
       [ 3,  8],
       [ 5, 12]])

In [21]:
demo * np.array(2)

array([[ 2,  4],
       [ 6,  8],
       [10, 12]])

In [22]:
demo - np.array([[1], [3], [5]])

array([[0, 1],
       [0, 1],
       [0, 1]])

In [24]:
import pandas as pd
# A dictionary of lists
df = pd.DataFrame({'a': [1, 2], 'b': [5, 6]})
# A list of dictionaries
df1 = pd.DataFrame([{'a': 1, 'b': 5}, {'a': 2, 'b': 6}])

In [25]:
df1

   a  b
0  1  5
1  2  6

In [28]:
df2 = pd.DataFrame({'a': 1, 'b': 5}, {'c': 2, 'd': 6})

In [29]:
df2

   a  b
c  1  5
d  1  5

In [30]:
a = pd.DataFrame([{'city': 'new york', 'lon': 100},
                  {'city': 'san francisco', 'lon': 120}])
b = pd.DataFrame([{'hospital': 'A', 'city': 'new york', 'beds': 90},
                  {'hospital': 'B', 'city': 'new york', 'beds': 20},
                  {'hospital': 'A', 'city': 'austin', 'beds': 210}])

In [31]:
a.merge(b, on='city')
# 只保留共有的部分，其余部分直接删去

       city  lon hospital  beds
0  new york  100        A    90
1  new york  100        B    20

In [32]:
a.merge(b, on='city', how='outer')

            city    lon hospital   beds
0         austin    NaN        A  210.0
1       new york  100.0        A   90.0
2       new york  100.0        B   20.0
3  san francisco  120.0      NaN    NaN

In [33]:
a.merge(b, on='city', how='left')

            city  lon hospital  beds
0       new york  100        A  90.0
1       new york  100        B  20.0
2  san francisco  120      NaN   NaN

In [34]:
a.merge(b, on='city', how='right')

       city    lon hospital  beds
0  new york  100.0        A    90
1  new york  100.0        B    20
2    austin    NaN        A   210